Sharvesh-Vetri/Embedded-Systems-Foundations-PIC16F887-STM32F103C6/PIC16 files/UART/gears/gear_txm.X/gear_txm.c
/*
 * File:   gear_txm.c
 * Author: Sharvesh V
 *
 * Created on 17 June, 2025, 3:14 PM
 */


#pragma config FOSC = INTRC_NOCLKOUT// Oscillator Selection bits (INTOSCIO oscillator: I/O function on RA6/OSC2/CLKOUT pin, I/O function on RA7/OSC1/CLKIN)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled and can be enabled by SWDTEN bit of the WDTCON register)
#pragma config PWRTE = ON       // Power-up Timer Enable bit (PWRT enabled)
#pragma config MCLRE = ON       // RE3/MCLR pin function select bit (RE3/MCLR pin function is MCLR)
#pragma config CP = OFF         // Code Protection bit (Program memory code protection is disabled)
#pragma config CPD = OFF        // Data Code Protection bit (Data memory code protection is disabled)
#pragma config BOREN = OFF      // Brown Out Reset Selection bits (BOR disabled)
#pragma config IESO = ON        // Internal External Switchover bit (Internal/External Switchover mode is enabled)
#pragma config FCMEN = ON       // Fail-Safe Clock Monitor Enabled bit (Fail-Safe Clock Monitor is enabled)
#pragma config LVP = OFF        // Low Voltage Programming Enable bit (RB3 pin has digital I/O, HV on MCLR must be used for programming)
#pragma config BOR4V = BOR40V   // Brown-out Reset Selection bit (Brown-out Reset set to 4.0V)
#pragma config WRT = OFF        // Flash Program Memory Self Write Enable bits (Write protection off)


#include <xc.h>
char data;

void transmit(char *data)
{
    int i;
    for(i=0 ; *(data+i)!='\0' ; i++)
    {
       TXREG=*(data+i);
       while(TXIF==0);
       TXIF=0;
    }
}

void main(void) 
{
    PORTA=0x00;
    TRISA=0xff;
    PORTC=0x00;
    TRISC=0x80;
    PORTB=0x00;
    TRISB=0x00;
    
    ANSEL=ANSELH=0x00;
    
    SPBRG=25;
    TXSTA=0x26;
    RCSTA=0x90;

    while(1)
    {
        transmit("GEAR N_");
        if(RA0==1)
        {
            transmit("GEAR 1_");
            while(RA0==1);
        }
        if(RA1==1)
        {
            transmit("GEAR 2_");
            while(RA1==1);
        }
        if(RA2==1)
        {
            transmit("GEAR 3_");
            while(RA2==1);
        }
        if(RA3==1)
        {
            transmit("GEAR 4_");
            while(RA3==1);
        }
        if(RA4==1)
        {
            transmit("GEAR 5_");
            while(RA4==1);
        }
        if(RA5==1)
        {
            transmit("GEAR R_");
            while(RA5==1);
        }
    }
}
